{
  "backend/main.mo": "Main backend actor implementing trip and expense management with CRUD operations, blob storage for bill images, and query functions for retrieving trips and expenses sorted by various criteria.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to debugging trip creation errors, refactoring the createTrip mutation flow, and adding comprehensive error handling with logging throughout the trip creation pipeline.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components for trip/expense management, forms with validation and error handling, React Query hooks, currency formatting utilities, and earth-tone styling configuration.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining an earth-tone color palette using OKLCH color space for both light and dark modes with consistent design tokens.",
  "frontend/index.html": "HTML entry point for the Travel Expense Tracker application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for trips list (index and /trips) and expenses page (/trips/:tripId/expenses) wrapped in a Layout component.",
  "frontend/src/components/BillImageModal.tsx": "Dialog modal component displaying full-size bill images with expense details (amount in Indian Rupees, category, date, notes) using ExternalBlob.getDirectURL().",
  "frontend/src/components/ExpenseForm.tsx": "React Hook Form-based component for creating/editing expenses with file upload for bill images (JPG/PNG validation), upload progress tracking, category selection, and amount validation with ₹ symbol placeholder.",
  "frontend/src/components/ExpenseList.tsx": "Displays a list of expenses for a trip with filtering, editing, deletion, and CSV export functionality. Includes a modal for viewing bill images and shows total expense amount with category-based color coding.",
  "frontend/src/components/Layout.tsx": "Main application layout component with header navigation, footer, and outlet for nested routes. Features a gradient background and branding with Plane icon and caffeine.ai attribution.",
  "frontend/src/components/TripForm.tsx": "Form component for creating and editing trips with fields for name, dates, and description. Uses react-hook-form for validation and handles both create and update operations with actor readiness checks.",
  "frontend/src/components/TripList.tsx": "Displays a grid of trip cards with edit, delete, and navigation functionality. Supports filtered trip display and shows empty states for no trips or no search results.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance based on Internet Identity authentication state. Automatically creates authenticated or anonymous actors and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality. Manages AuthClient creation, identity persistence, and authentication status tracking throughout the application.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for trip and expense CRUD operations (get, create, update, delete) using the backend actor, with extensive console logging for debugging.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom earth-tone color palette using OKLCH color space, defining CSS variables for light and dark modes with emerald, brown, and teal accent colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/ExpensesPage.tsx": "Displays expenses for a specific trip with add/edit forms, export to Excel functionality, and navigation back to trips list.",
  "frontend/src/pages/TripsPage.tsx": "Main trips listing page with search functionality, create/edit trip forms, and navigation to individual trip expense pages.",
  "frontend/src/utils/exportToExcel.ts": "Utility function that exports expense data to CSV format with proper escaping and downloads it as a file.",
  "frontend/src/utils/formatCurrency.ts": "Simple utility function that formats numbers as Indian Rupees currency with ₹ symbol and two decimal places.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors using OKLCH, border radius variables, custom shadows, Inter font family, and accordion animations.",
  "project_state.json": "Project state file for a Travel Expense Tracker web application built with React/TypeScript frontend and Motoko backend on Internet Computer, featuring trip management, expense tracking with image uploads, and Excel export. Currently has a known issue where the trip creation form submission is not working."
}